{
	"content": "![](data/assets/1462026139331_glass.jpg)\n\n我和妻子宫若是物理学博士，近几年随着量子力学的快速发展，瞬时造影技术成为可能。该技术可以在0.3纳秒内将一辆面包车大小的物体原子组合状态记录下来，但是相对的需要大量的存储资源来保存这些数据。这项技术已经在一些大型医院进行了部署，帮助医生得到极其精确的病人生物学信息。同时，也正是这项发明，使得我们夫妻两获得了当年的诺奖、独立实验室和庞大的资金支持。\n\n可能你已经想到了，既然可以拷贝完整的原子信息，那是否可以再制造一台原子打印机将物品“打印”出来？——这正是我们目前正在进行的实验。\n\n虽然造影技术已经成熟，然而瞬时打印却相距甚远。目前，我们制造的原子打印机只能打印兵乓球大小的物体。超过这个数值，物体会由于原子连贯性迸裂导致损毁。光是这种打印，都需要10纳秒的时间。\n\n本来一切都会按部就班的前进，然而一场意外却使得我们的家庭受到了巨大的打击。\n\n在3年前，我们深夜从实验室回家，一辆飞驰的跑车突然出现将我们撞飞。我由于脑震荡成为了植物人，而妻子也被撞成了重伤。车主是一个二代，他们家人找躺在床上的妻子要求私了被妻子言辞拒绝。最后，这位肇事者背叛坐牢3年。妻子康复后一边上班一边照顾我。过了将近3年，我终于恢复了意识，可以和妻子进行交流了。但是车祸甚至之前的事情都想不起来了。\n\n结果生活并没有来得及走回正轨，出来的二代做的第一件事不是忏悔，而是趁妻子下班的深夜为报复而将她杀害了，随后逃之夭夭。\n\n这一年中，我一直处在痛苦之中。你以为生活已经柳暗花明，结果其实只是沙漠中的海市蜃楼。都是幻觉！\n但是，我还有一条路可以铤而走险。当年在进行人体造影实验的时候，我和宫都对自身进行了造影。如果，排除灵魂这些虚无的东西。有可能，我是说有可能，我可以打印出一个稍早一些的宫。我被自己这疯狂的想法吓到了，但是，如果能再见到宫，我觉得我值得冒险……\n\n如今，我终于再次回到了实验室。要将我们的实验，继续下去。\n\n“南教授，这是宫教授在世时写的论文以及实验资料。”安助理将厚厚一叠文件交给我。\n这一年虽然是在床上度过，但是和宫的交流中，我对实验进程还是有些了解的。\n\n从质能方程推导，随着原子打印时间缩短，需要的能量就越大，大物体的整体打印需要消耗能量呈指数级上升。所以宫的折中方案是将物体数据进行切分，将物体从弱连贯处切分成多个小物质，然后在打印后再将其进行连接。\n\n花了一个月的时间后，终于看完了所有的文档，了解了目前的进度。拆分想法的确从能量和实现角度更具有优势，但是算法相对过于原始。世上仅有几所大学拥有大型量子计算机可以运行这种算法。\n\n“还是得找其他的途径才行。不知道计算机界算法进程如何了？”我一边自言自语，一边查询了最近的计算机议会。机器学习的算法日渐成熟，谷歌阿尔法go已经横扫了所有人类娱乐游戏。如果将机器学习应用在造影切分是否可行呢？\n\n想罢，我就和阿尔法go的设计师进行了沟通。对方也对我的想法感到兴趣。一场浩大的原子学习之路开始了。\n\n“南教授，我们需要大量的训练集。然而从目前沟通看，你们唯一可以用到的就是目前的切分算法产生的数据。而然……”\n\n“然而目前的算法仍然不准确，在错误的数据上进行训练并不是个好主意。”\n\n“嗯，我就这个意思。不过你可以先将这些数据发给我们，我们还没有在原子级别上进行过训练呢~”\n\n“没问题。”挂了电话后，我有些沮丧。造影切分的缺点就是如此大量的原子数据，根本无法通过人肉来进行拆分，只能通过不断调整算法进行拟合。\n由于训练数据不足，进展并不理想。我在继续改进着宫的算法进行试验。\n\n“南教授，这是今年的预算。”安助理将预算书交到我手中。我简单翻阅了一下，觉得十分有趣。虽然每年预算差不多，但是实验数据在第二年的时候反而少了不少，想必是走了一些弯路。\n\n算法对比让人十分煎熬，每次都需要将计算完后的数据再经过原子打印机打印组合来观测结果。好在结果不错，每次改进都有些进步。\n\n而机器学习组那边，工程师发现了一条新的路径。他们通过将物品原本的设计图对物品进行微调，通过原子打印进行再造影，对比后再反向输出到训练集中。\n\n经过5年的时间，物品打印终于走进了现实。通过阿尔法go，可以对物体进行精准的拆分（大部分啦）。为此，我们又拿到了一次诺贝尔奖。而我的计划，也终于有机会走向实现了。\n\n当实验室组员都下班后，我会偷偷进行生物造影打印实验。通过将数据发送给阿尔法go的接口获取的拆分图谱进行打印测试。除了原子打印机原料异常充足外，其结果真是一团糟！\n\n只有不需要拆分的生物，诸如蟑螂。才能在10纳秒的打印中存活下来。一旦进行拆分，情况就会变得十分复杂。相对于拆分打印，组合需要数分钟的时间。然而体循环系统却支撑不起这么久的时间，最终只能得到一具到处是血破碎不堪的尸体罢了。\n\n回到家后，我不禁有些失落。如果不能一次性打印完成，体循环系统就是需要立刻解决的问题。除非能够缩短组合时间，否则生物根本无法“活起来”。指数级的能量消耗成了绊脚石，这似乎走进了死胡同。\n\n我漫无目的地翻着我们的相册，看着过往的点点滴滴。这是我们第一次约会的地方，那时不止所错的让你嫌弃我太呆；这是你在喂实验室门口的野猫，你知道吗？学院里可到处都是它的孩子哦。突然一张照片引起了我的注意，这是我们获得诺奖前参观备选者的液氮实验室的照片。那时，由于我们研发的造影技术，人体冷冻实验也由此突破了最后的难关。通过造影对比，人类掌握了原子运动的秘密，使得曾经冷冻的人体解冻成了可能（虽然前几个解冻的人最后还是成了碎片……）。\n\n我如果将造影数据进行修改，将其温度改成低温。然后通过复温的方法就不需要考虑体循环的问题了。说干就干，我立刻查询了液氮实验室相关的论文和造影数据。活体与冷冻转换并不是太大的难题，使用量子计算机可以很方便地算出降温后的造影状态。\n\n在几十次实验后，我终于成功复制出了小白鼠。在观察了一段时间后，确认了可行性。我需要实验更大型的生物，用什么生物呢？\n\n突然，一阵不详的预感出现在我的脑中。我赶紧回到家中，将液氮作为关键词对电脑进行全文搜索。果不其然在一处隐藏的文件夹中有着相同的文章。\n\n原来车祸失去的记忆，第二年消失的实验数据，原子打印机充足的生物原子材料，学院到处都是花色的猫，以及这个隐藏的文件夹。唯一的原因，就是宫当年做了同样的事情，也就是说，其实那场车祸，“我”早就死了。宫用了2年的时间，研究出如何打印我。那些消失的实验数据，就是生物实验啊！这也是为什么，我的身体没有任何车祸的后遗症。这个我，还是我么？\n\n在混乱了一段时间后，我突然笑了。如果宫能够用她的算法来复活我，那我复活她更加不是问题。唯一可惜的，只是我们损失的这几年记忆而已。想完，我便回到学院，卷起袖管准备抓只花猫……",
	"title": "镜中人",
	"tags": [
		"科幻",
		"小说"
	],
	"createTime": 1462024590200,
	"thumbnail": "data/assets/1462026139331_glass.jpg"
}