{
	"content": "![](data/assets/1475474024405_diamonds.jpg)\n\n<p class=\"hidden\">\n老赵是我们生物实验室呆的最久的人，他的博士论文《碳基P49群聚效应研究》憋了8年都没有憋出来。\nP系列是我们实验室创造的人工碳基生命，在经历了整整48代失败后，终于实现了该生命体的体循环与繁殖。也正因为这个壮举，使得我们确立了国际领先的地位。\n</p>\n\n吃完了午饭，我回到实验室，看到老赵在沙箱边观察着P48——一种人造碳基生命。我打趣的问道，“老赵，还在想你那没写完的论文？”\n\n老赵摇了摇头，表情略有些严肃。“你不觉得这个世界是如此的神奇么？几十年前，我们连飞机都没有，现在居然已经可以创造人工生命了。只可惜这东西丑了点，像个甲虫。”\n\n“制造能够繁衍的哺乳动物的难度太大了，不过我觉得迟早能实现的。到第几代？P2333？”，我笑道。\n\n“可能吧。”老赵仍然表情严肃。这时他面前的一只P48刚刚吃完食物，伸出舌头排出消化所产生的多余热量，好像一条狗。“在P48之前的整整47代都因为各种原因失败了，你说那些生命体在无法适用这个世界的时候，它是什么感受。会不会感到痛苦呢？”\n\n“不会吧。这些小东西根本没有完备的大脑。另外，神经系统也被简化了。”我和老赵一同看着那只P48，心想就是因为这个小东西，让我们实验室一下子打出了名气，在国际上确立了领先的地位。但是说实在的，它在自然环境中，生存能力还不如一只蚂蚁。\n\n正闲扯着，突然老赵的定时闹钟响了。他赶紧拿起特制的饲料在规定的几个地点投了下去。“这次是H8和E3。”他看着记录说道。按照设计，P48只会简单找到食物并食用。但是奇怪的是，P48在群聚后表现了一部分的社会性。比如当一个区域的P48密度到达一定程度后，这些P48就不会再去往其他区域。即便是把食物投放到其他区域，P48也不会去取食。随着时间推移，该区域的P48越来越多，最终导致大面积群体性死亡，让人头疼。\n\n“或许这是生物的自发行为，例如遇到外界威胁，通过群聚提高生存能力？”我问道。\n\n“说不过去呐。你这个沙箱中哪里有威胁？按理说，应该自然分布才对。”这时，另一只P48也吃完食物，伸出舌头开始排热。\n\n“诶？你说会不会是因为温度影响？当P48排热的时候，造成了细微的温度扰动。进而吸引了其他的P48靠近？”\n\n“诶？！”老赵突然灵光闪现，“有可能。因为P48的神经系统很脆弱，他们无法区分温度差异。平时在恒温环境这并不重要，但是因为升温会降低P48的行动能力。随着P48的聚集，温度持续上升，导致最后所有的P48都走不动路了。”\n\n老赵笑着，赶紧着手设计实验起来。\n\n果不其然，老赵的设想符合实验结果。于是他改造了P48的神经系统，让其支持温度的感应。结果另一个问题又出现了，由于P48会避开温度较热的区域，导致所有的P48都不会接近彼此。因而导致无法繁殖了。\n\n“哎，你说这些小东西怎么这么麻烦呢。”老赵看着P49有些心烦。\n\n“哈哈，如果可以给它们弄个户口制度就好了，让它们无法离开自己的固定区域。”我看着今天刚刚更新的户籍计分表说。\n\n“再顺道来个房产税是吧？”老赵睨了我一眼，看着P49又开始发呆起来。\n\n我干笑一声，自觉没趣便开始研究起最新的积分政策来。看看如何才能申请下本地户口。\n\n第二天本计划请上午半天假办理手续，却没想到高估了政府机关的执行能力，忙了一整天居然还有其他的表需要填。隔天到实验室的时候，发现老赵正笑眯眯地盯着我看。\n\n“干什么？你都看的我发毛了！”我假装打了个冷战。\n\n“哈哈哈，我要谢谢你呐。”老赵露出了16颗牙齿。“你昨天不是说户籍制度嘛？我又仔细考虑了一下。觉得挺靠谱。所以我实验了一下。”于是指了指沙箱，我顺势看了过去。发现沙箱用石灰粉划出了一条条线。形成了一个个的矩形区域，而每个区域之间又画了几条“道路”联通。\n\n“我在想，既然是因为土地太多导致了这些小东西不肯聚在一起。那我直接减少空间不就行了？”老赵得意地说，“我用石灰粉将区域缩小，然后P49就很自然的靠近起来了。于是，又可以开始繁殖了~”\n\n“那你干嘛在区域间画一些道路呢？”我有些疑惑。\n\n“我准备将食物放在P49稀疏的区域，并减少富集区域的食物量。模拟一下‘限购’效果会不会把这些小东西排挤出去？”\n\n“哦。”我点了点头，准备去填另一张没有完成的表......",
	"title": "P49",
	"tags": [
		"科幻",
		"小说"
	],
	"createTime": 1475473475024,
	"thumbnail": "data/assets/1475474024405_diamonds.jpg"
}