{
	"articles": [
		{
			"title": "鸡蛋",
			"introduction": "\n今天准备食材，准备打3个蛋。而人生的悲剧，莫过于第三个蛋居然是坏的。无奈之下，只能把所有的蛋全扔了。随后打了第四个，又是坏的。我一度还是怀疑，是不是蛋都有问题？\n在小心翼翼，一个蛋一个碗后，确认接下去的三个都是好蛋。做一顿饭菜，如此麻烦。\n前几天清明扫墓，在墓地有种莫名的孤独感。说来也怪，明明四周都是人，但是你仍然感到孤独。甚至又有些其他什么古老的回忆，让人捉摸不透。你想到周围埋着的不同时代的人",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1459865321598_egg.jpg",
			"createTime": 1459866063121
		},
		{
			"title": "故地游",
			"introduction": "\n周末的时候再次去了一次世博原址，看了一下上海当代艺术馆。大部分的地都已经荒芜了，路边的栏杆依稀能够回味出当时的人潮涌动。然而物是人非，沿街的草已经有些漫长，路灯的铁锈也变得斑驳。\n蛇杖III\n展馆还不错，夫人说很喜欢这种莫名其妙的作品。我何尝不是呢？不过可惜，这次展览的作者比较喜欢暴力美学。所以拍的照也不适合都放上来。就暂且留一张巨蛇的照片吧~\n现代艺术比较有意思的地方，就是作者会在展馆现场创作",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1459257188995_snak.jpg",
			"createTime": 1459257983250
		},
		{
			"title": "正能量与负能量",
			"introduction": "\n读书人的缺点就是想得事情相对比较多些，自然而然会有一些额外的烦恼。往往事后再去想想也的确不是什么事儿。\n之前说过去北京做演讲，着实有些累人。一来是不太爱人多的地方，二来北京这交通和空气都很闹人。下飞机的时候，就感到空气极其糟糕。然而眼看司机又各个不带口罩，不禁为其身体有些担心。\n用了地图软件，发现没有一个能够准确预测时间。往往一小段路可以堵个半天。十分不想出门。\n网上不知什么时候起，开始流行鸡汤",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1458716166888_sunflower.jpg",
			"createTime": 1458716732001
		},
		{
			"title": "预测未来",
			"introduction": "\n在上班路上，突然想起过去看到的文章。里面讲为何预测未来无法实现。因为预测未来需要涉及宇宙中的所有物质，而作为数据存储容器，存储的所有数据必将包含其自身。所以可以推导出无法预测未来。\n我突然想到，那是否真的预测未来需要涉及所有物质呢？在平行宇宙概念中，有一种平行宇宙叫做“视界平行宇宙”。视界平行宇宙指代人类可以观察到的宇宙范围，在可观察到的宇宙范围外的区域对于观察者而言不能产生影响。\n作为科幻党，",
			"tags": [
				"胡思乱想"
			],
			"thumbnail": "data/assets/1458182441363_Shut-up-and-take-my-money.jpg",
			"createTime": 1458183561072
		},
		{
			"title": "出行之前",
			"introduction": "\n下周就要出发去北京了，开会需要准备的PPT还没有准备，心里有些紧张。也是因为这是第一次出去开会做讲，需要面对这么多人有些不知所措。\n而今天在家，本希望周末可以出门逛逛。可是谁知天气异常的冷，还下着细雨。于是这出门的兴致也一下子被打消了。在家中呆了一天，想着我应该做些什么。恍恍惚惚间又有些烦恼，想着应该做很多的事情，又什么都不愿意动手。似乎这周末的休息日就应该如此懒着。\n出神间，突然想起了早上梦醒",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1457876838345_bicycle.jpg",
			"createTime": 1457877445109
		},
		{
			"title": "玩具",
			"introduction": "\n难得回家，突然心血来潮打量了一番门边堆满杂物的电脑桌。\n还记得刚刚工作的时候，一直很期待能够配一台强劲的电脑，可以畅快地写写代码、打打游戏（好吧，后者更重要）。虽然电脑可能暂时配不起，但是可以先买个电脑桌嘛，于是和母亲到家具市场仔仔细细地挑选着电脑桌。\n在下一直很喜欢深色系，说来理由也很有趣，我一直觉得浅色的物品总是很容易脏。在千挑万选和老板讨价还价后，隔日送了过来。为了放下这个电脑桌，把家中呆",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1457706035070_玩具车.jpg",
			"createTime": 1457707673736
		},
		{
			"title": "春雨",
			"introduction": "\n当春天光顾这座城市许久，本以为春天已经到来的时候。突然来的大风大雨把冬天又带了回来。\n记得上周末的时候，已经收拾起了呢子大衣。母亲说还需带上，周二就会降温。想来这话有些熟悉，曾经在外就学的时候，母亲也是这般关照。每每出发去外地前，母亲总会细心地把季节需要穿到的衣服逐一整理。现在回来了，倒都是自己来照看。免不得东丢一件西默一件。往往配套的衣服最后总是不知道另一份去了哪里。很是苦恼。\n今日正巧也是妇",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1457450818962_rain.jpg",
			"createTime": 1457451075897
		},
		{
			"title": "喵咪问题",
			"introduction": "\n最近在看一本书《悖论》，里面举了不少概率问题。其中有一道关于猫咪的问题，很是有趣。今日，想分享一下~\n这道概率的问题有两个小问题：\n\n有两只猫，一只黑猫一只花猫。其中一只是公猫，请问两只都是公猫的概率是多少？\n有两只猫，一只黑猫一只花猫。其中黑猫是公猫，请问两只都是公猫的概率是多少？\n\n两个问题似乎就只有一个词儿不一样。乍看之下，感觉应该是同一个答案，但是仔细分析一下，便会发现，这两个描述讲的是",
			"tags": [
				"概率"
			],
			"thumbnail": "data/assets/1457401528918_cat.jpg",
			"createTime": 1457402844363
		},
		{
			"title": "周末",
			"introduction": "\n每次提笔写日志，标题和配图总是很烦恼的事情。无非天气好了，就像选些太阳和绿叶的图片。标题也无非暖啊春啊什么的。显得格外词穷。夫人曾经说过，如果想把文字写的好，最简单的就是多读书。道理简单明了，但是我还是没办法静下心来。有段时间下载了一本小清新的书，初看的时候的确喜欢，写的非常平淡而又有趣。但看到一半，便有些迫不及待起来，总是想快点翻页过去，又觉得翻过去了很是可惜。最后，也被我搁在了一边。\n回到这",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1457190385159_apple.jpg",
			"createTime": 1457190673448
		},
		{
			"title": "薄荷春",
			"introduction": "\n今天天气出乎寻常的暖和，也怪我今天需要早些去上班开会，因而忘记查看了天气预报。由于出门早，太阳还未高，就这样一路到了公司。\n急急忙忙和外国人开会，还好大部分时候都是我在说。偶尔有些问题，同事帮忙回答了一下，也算是对付下来。前些天，千叮万嘱的坑也没有让我踩，甚是万幸。回到座位，看了看窗前的薄荷，不知道春天来了。它是否会再次萌发新芽呢？想着，又浇了些水。\n下午请假去银行办理业务，路上正担心是否会漏带",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1457006610413_mint.jpg",
			"createTime": 1457006643818
		},
		{
			"title": "食",
			"introduction": "\n很喜欢一款APP叫做《下厨房》，每次不知道吃啥的时候，就喜欢在上面看看有什么推荐菜。往往食材不复杂，又能做出一些花样来。——不过现实是，我是不会做菜的。所以只是看看而已。\n每次APP打开的时候，载入页的标语“唯有美食与爱不可辜负”甚是得我心。读着这句话，似乎鲜美与甜蜜已经印入了心里。\n后来有了家庭，更是深以为然。回家的时间比夫人早一些，所以会把所有的食材都洗净准备完毕，供夫人回来做菜。在准备的时",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1456926698271_food.jpg",
			"createTime": 1456927616351
		},
		{
			"title": "房",
			"introduction": "\n最近看了知乎，发现随着房价分化加剧，房地产的讨论越发热烈。不同于火爆的楼市，知乎的用户均觉得房价将会崩盘并列举了诸多线索。这让我想起了2010年在《读者》上看到的一片抱怨房价上涨的文章，说房价上涨消耗了创新力、导致了购买力下降、人们辛苦多年仍然买不起房等等等等。如今一看，居然还是十分有理。可惜房价已经翻了不止一倍，不知道当时写了这篇文章的作者最后有没有买房。如果没买，那可真是个悲剧的故事。\n曾几",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1456580121622_night.jpg",
			"createTime": 1456580702865
		},
		{
			"title": "密室逃脱",
			"introduction": "\n今天去了密室逃脱，背景讲述了某所学校中一个常常受欺负的女生死去冤魂不散的。而我们作为探险者，被所在了这所学校，需要解放女生的冤魂才能逃离学校。\n不得不说的确是一部设计精良的密室，线索隐藏在各个细节之中。但是由于游戏中视频略多，不少时间消耗在了看视频上。不过你懂的，视频相对声音，细节非常的多。在苦无头绪之下，只能求助。结果发现线索没啥逻辑，汗颜……\n中间有个器材坏了，工作人员补了10分钟。不过我感",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1456325991809_幽灵.jpg",
			"createTime": 1456326637271
		},
		{
			"title": "薄荷叶",
			"introduction": "\n去年种的薄荷随着那场极寒之潮而枯萎了，倒是当时随意折下放入水中的断枝生了根。但是由于缺乏营养，叶片泛紫还有些纤薄。前几日天气不错正准备将其移植回花盆中，不想天气又变冷了。好吧，还是老老实实的等春天了，再把它种回来吧。",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1456235174530_太阳.jpg",
			"createTime": 1456235619909
		},
		{
			"title": "元宵节",
			"introduction": "\n今日回家，准备去超市汤圆。看到不少年轻人排队买汤圆，不禁觉得有些有趣。本以为只有我会特地来买汤圆呢~\n说起元宵节，以前在家的时候。母亲总会热一碗汤圆给我，打开锅盖冒着热气，甜甜地问问想吃多少个？然后不管我说多少个，都会给我盛下一大碗汤圆。我不太喜欢吃芝麻汤圆，总是不太愿意。后来母亲会下些肉馅的汤圆，但是还是会说吃芝麻陷才纯正。不过后来有了水晶汤圆，我发现水果口味还挺好吃的~\n元宵快乐！~",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1456148550647_dumplings.jpg",
			"createTime": 1456148980785
		},
		{
			"title": "冬日游",
			"introduction": "\n闲来无事，出离远郊去了市区漫无目的地闲逛。偶然遇见了《琉璃展》，购置门票时年轻的保安提醒说可以拍照但是禁止闪光灯、禁止触摸，便进入了展区。\n二楼是使用琉璃丝线组合，再通过加热弯曲制成的琉璃制品。由于使用各种颜色的琉璃丝，以至于饰品颜色充满层次感。\n\n三楼类似使用气泡琉璃技术，使得玻璃中气泡组合成不同的图案。\n\n之后，又见到了琉璃雕塑，颇有意境。\n\n唔，感觉整个人都入蝉了呢~",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1456064812693_glass.jpg",
			"createTime": 1456070055263
		},
		{
			"title": "老街",
			"introduction": "\n今日偶然路过小时候走过的老街，已经拆得面目全非。小时候并不觉得有什么特别，甚至还有些破旧的地方突然间就没有了。地上尚未拆走的残砖还依稀勾勒出它曾经的形状。\n我依稀记着在很小的时候，父母带着我去过前面不远处的一个早餐店，点了一份好像叫酱油百油布的食物，和着肉馅一层层吃掉外面的豆皮，淡淡的酱油汤带来一丝丝咸味儿，别是一番滋味。那时觉得是人间美味，但若是如今，可能只是万千简菜中的一粟，并不见得引起我的",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1455982491006_oldStreet.jpg",
			"createTime": 1455983119243
		},
		{
			"title": "蜂蜜与四叶草",
			"introduction": "\n偶然的机会，在B站看到了完结的《蜂蜜与四叶草II》。不禁有些恍然，没想到这么巧能遇见很久以前看的动画。也不禁有些感叹，第二部居然也是10年前的事情了。\n《四叶草》是我至今看来最贴近现实的青春故事。故事里的主角没有开挂的才华，也没有俊朗的外表，是万千普通人中的一个。甚至也不是这恋爱故事中的一员，只是暗暗的喜欢，度过一场不完美却格外真实的青春。\n时隔多年观看了第二部，看到主角骑着自行车发泄着自己的精",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1455866388804_honeyAndClover.jpg",
			"createTime": 1455867607860
		},
		{
			"title": "暖风",
			"introduction": "\n今天如往常一样冬装上班，到下午的时候不禁感觉有些热气。加上空调有些微微出汗，不禁想到周末如果也是这样，倒也挺不错。是个春暖花开的好天气~\n下班的时候，气温渐冷，倒恰如其分的温度刚刚好。不禁让我想起了当年还在大学的时候，也恰恰是这种温度。春风拂过，像丝绸一样摩挲着皮肤。似乎那时候刚刚上完一天的课，天气几近黄昏，夕阳还未落下，在空中轻轻地挂着。随着依稀的人群，默默地走在通往食堂的路上。点一简餐，慢悠",
			"tags": [
				"随笔"
			],
			"thumbnail": "data/assets/1455797793014_chrysanthemum.jpg",
			"createTime": 1455797870591
		},
		{
			"title": "新的开始~",
			"introduction": "\n人总是喜欢瞎折腾。用了一段时间的基于PHP的github Blog后，感觉受到的限制太多。尤其在是win下常常涉及到git的权限问题，让人非常苦恼。\n于是乎，趁着近来在玩NW.js。决定用NW把原本基于PHP的博客系统全部替换掉。不得不说，这真是一个明智的决定。抛开了PHP，重写了一遍Blog花的时间少了很多。另外，还加了一些额外的功能。\n因为上个版本，被说UI太丑。所以借着在apache-ea",
			"tags": [
				"gitBlog",
				"随笔"
			],
			"thumbnail": "data/assets/1455681601696_start_mini.jpg",
			"createTime": 1455681012425
		}
	]
}